package persistence.dao;

import persistence.dto.BulletinDTO;

import java.nio.charset.StandardCharsets;
import java.sql.Timestamp;
import java.time.LocalDateTime;
import java.util.Date;

public class Test {


    public static void main(String[] args) {
        String str = "모쟈돌몾뎌ㅑㅊㄹㅑㅊㄹㅐㅁ쟏랴ㅕㅁ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹ댜ㅕ로" +
                "먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹㅐㅁ쟏랴ㅕㅁ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹ댜ㅕ로먀ㅕ" +
                "ㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹㅐㅁ쟏랴ㅕㅁ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹ댜ㅕ로먀ㅕㅈ도랴ㅕ모" +
                "쟈돌몾뎌ㅑㅊㄹㅐㅁ쟏랴ㅕㅁ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹㅐ" +
                "ㅁ쟏랴ㅕㅁ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹㅐㅁ쟏랴ㅕㅁ댜ㅕ로먀ㅕ" +
                "ㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹㅐㅁ쟏랴ㅕㅁ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾" +
                "뎌ㅑㅊㄹ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹㅐㅁ쟏랴ㅕㅁ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹ댜ㅕ로" +
                "먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹㅐㅁ쟏랴ㅕㅁ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌" +
                "몾뎌ㅑㅊㄹ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹㅐㅁ쟏랴ㅕㅁ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹ댜ㅕ로먀ㅕㅈ" +
                "도랴ㅕ모쟈돌몾뎌ㅑㅊㄹㅐㅁ쟏랴ㅕㅁ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹㅐㅁ쟏랴ㅕㅁ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹㅐㅁ쟏랴ㅕㅁ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹㅐㅁ쟏랴ㅕㅁ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹㅐㅁ쟏랴ㅕㅁ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹㅐㅁ쟏랴ㅕㅁ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹㅐㅁ쟏랴ㅕㅁ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹㅐㅁ쟏랴ㅕㅁ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹㅐㅁ쟏랴ㅕㅁ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹㅐㅁ쟏랴ㅕㅁ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹㅐㅁ쟏랴ㅕㅁ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹㅐㅁ쟏랴ㅕㅁ댜ㅕ로먀ㅕㅈ도랴ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹㅐㅁ쟏랴ㅕㅁ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹㅐㅁ쟏랴ㅕㅁ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹㅐㅁ쟏랴ㅕㅁ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹㅐㅁ쟏랴ㅕㅁ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹㅐㅁ쟏랴ㅕㅁ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹㅐㅁ쟏랴ㅕㅁ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹㅐㅁ쟏랴ㅕㅁ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹㅐㅁ쟏랴ㅕㅁ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹㅐㅁ쟏랴ㅕㅁ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹㅐㅁ쟏랴ㅕㅁ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹㅐㅁ쟏랴ㅕㅁ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹㅐㅁ쟏랴ㅕㅁ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹㅐㅁ쟏랴ㅕㅁ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹㅐㅁ쟏랴ㅕㅁ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹㅐㅁ쟏랴ㅕㅁ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹㅐㅁ쟏랴ㅕㅁ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹ댜ㅕ로먀ㅕㅈ도랴ㅕ모쟈돌몾뎌ㅑㅊㄹ댜ㅕ로먀ㅕㅈ도랴ㅕ";
        byte[] b = str.trim().getBytes(StandardCharsets.UTF_8);
        System.out.println(str.length());
        System.out.println(b.length);

    }

}
